<?php
// +----------------------------------------------------------------------
// | CMSPRO v1.0.0
// +----------------------------------------------------------------------
// | 版权所有 2018~2118 菏泽市牡丹区德品网络服务中心 [ http://www.depin.net ]
// +----------------------------------------------------------------------
// | 官方网站：http://www.cmspro.cn
// +----------------------------------------------------------------------
// | 作者: 任华立 <715287@qq.com>
// +----------------------------------------------------------------------
/*
 * 全局公共文件
*/

//初始 session
if (!session_id()) session_start();
//载入系统基础类
$_cp = new cp();
//载入全局控制器总类
$_app = new app();
//处理Cookie没有HttpOnly标志
ini_set("session.cookie_httponly", 1);

//系统配置全局化
define('DATA', file_get_contents(PATH . '/cmspro/data.cmspro')); 
//数据库表前缀
$_tb = DB_PREFIX;

//全局配置信息
$_data = unserialize(DATA);